api.denver/app/Controllers/Actividad.php

    public function index(){
        $actividades = $this->model->findAll();
        $topicoModel = new TopicoModel();
        $data["actividades"] = [];
        foreach($actividades as $actividad){
            $data["actividades"][] = [
                "id" => $actividad["id"],
                "nombre" => $actividad["nombre"],
                "descripcion" => $actividad["descripcion"],
                "topico" => $topicoModel->find($actividad["idTopico"])
---
SELECT *
FROM `topico`
WHERE `topico`.`id` = '1'

    public function getByTopico($idTopico){
        $result["actividades"] = $this->model->getByTopico($idTopico);
        $topicoModel = new TopicoModel();
        $result["topico"] = $topicoModel->find($idTopico);
---
SELECT *
FROM `topico`
WHERE `topico`.`id` = '2'