api.denver/app/Controllers/Padre.php

SELECT *
FROM `infantes`
WHERE `infantes`.`id` = '2'
---
    public function index(){
        $infanteModel = new InfanteModel();
        $padres = $this->model->findAll();
        $data["padres"] = [];
        foreach($padres as $padre){
            $data["padres"][] = [
                "id" => $padre["id"],
                "nombre" => $padre["nombre"],
                "apellido" => $padre["apellido"],
                "direccion" => $padre["direccion"],
                "telefono" => $padre["telefono"],
                "correo" => $padre["correo"],
                "pass" => $padre["pass"],
                "idInfante" => $infanteModel->find($padre["idInfante"])