api.denver/app/Controllers/Terapeuta.php

    public function index()
    {
        $data=[
            "terapeutas" => $this->model->findAll()
        ];
---
SELECT *
FROM `terapeutas`