app/Controllers/Infante.php

    public function index()
    {
        $data=[
            "infantes" => $this->model->findAll()
        ];
---
SELECT *
FROM `infantes`