api.denver/app/Models/ActividadModel.php

SELECT *
FROM `actividad`
WHERE `idTopico` = '2'
---
    public function getByTopico($id){
        $list = $this->asArray()->where(["idTopico" => $id])->findAll();